### Series and Dataframe

In [ ]:
# Series-> A pandas series is one-dimensional array-like object that can hold any data type. It is similar to column in a table.

In [1]:
import pandas as pd

In [4]:
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series \n", series)
# Check type
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
# There is index respect to column.

#### Create a Series from dictionary.

In [6]:
data = {'a':1, 'b':2,'c':3  }
series_dict = pd.Series(data)
print(series_dict)
# Check type of data type.
print(type(series_dict))

a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
# Key become my index.

#### Series with Index assign.

In [7]:
data = [1,2,3,4,5,6]
index = ['a','b','c','d','e','f']

pd.Series(data, index=index)

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

## Dataframe

In [10]:
# It is 2-D mutable and hetrogenous data type array which is structured as rows and column.

In [34]:
# Create a dataframe from dictionary of list.
data = {
    "Name" :["Aditya", "Vivek", "Harsh"],
    "City" :["Bangalore", "New York", "Jaipur"],
    "Age" :[22,22,20]
}

df = pd.DataFrame(data)
print(df)
print(type(df))

     Name       City  Age
0  Aditya  Bangalore   22
1   Vivek   New York   22
2   Harsh     Jaipur   20
<class 'pandas.core.frame.DataFrame'>

In [ ]:
# You can see three columns Name, City and Age and Respected data and also have index.

#### Convert Panda into Numpy

In [13]:
import numpy as np
np.array(df)

array([['Aditya', 'Bangalore', 22],
       ['Vivek', 'New York', 22],
       ['Harsh', 'Jaipur', 20]], dtype=object)

In [ ]:
# In numpy you can see it escape column and no indexing.

#### Create a dataframe from a list of Dictionaries.

In [35]:
data =[
    {'Name': 'Aditya', 'Age': 22, 'City': 'Jodhpur'},
    
    {'Name': 'Lavaniya', 'Age': 19, 'City': 'Delhi'},
    
    {'Name': 'Ashii', 'Age': 22, 'City': 'Kota'}

]


df = pd.DataFrame(data)
print(df)
print(type(df))

       Name  Age     City
0    Aditya   22  Jodhpur
1  Lavaniya   19    Delhi
2     Ashii   22     Kota
<class 'pandas.core.frame.DataFrame'>

## Read data from .csv file

In [22]:
df= pd.read_csv('customers-100.csv')
df.head() # Top Five
df.tail() # Last Fivce

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
95,96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,2022-01-30,http://hayes-perez.com/
96,97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,+1-846-706-2218,605.413.3198,vkemp@ferrell.com,2021-07-10,https://novak-allison.com/
97,98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,2021-09-18,https://www.ross.com/
98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,2021-08-11,http://watkins.info/
99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/

#### Accessing data from Dataframe

In [ ]:
df 
df['Name'] # Accessing Name from df Dataframe

0      Aditya
1    Lavaniya
2       Ashii
Name: Name, dtype: object

In [ ]:
# If you pick up the one column it will become series.
# Check by-> type()

type(df['Name'])

pandas.core.series.Series

##### loc()

In [ ]:
# loc()-> It is work with row index only. It is label based selection
# loc()-> location
#df.loc[row_labels, col_labels]

In [46]:
df.loc[0][0]

C:\Users\adity\AppData\Local\Temp\ipykernel_23896\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Aditya'

##### iloc()

In [ ]:
#iloc()-> It is work with index only, but it is integer based selection.
# iloc()-> index location
#df.iloc[row_positions, col_positions]

In [45]:
df.iloc[0][1]

C:\Users\adity\AppData\Local\Temp\ipykernel_23896\2309508539.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][1]

np.int64(22)

##### at-> Accessing a specified element.

In [48]:
df.at[1,'Age']

np.int64(19)

##### iat-> Accesing specified element.

In [52]:
df.iat[2,2]

'Kota'

## Data Manipulation with Dataframe

In [53]:
df

       Name  Age     City
0    Aditya   22  Jodhpur
1  Lavaniya   19    Delhi
2     Ashii   22     Kota

##### Adding new column

In [71]:
df['Salary'] = [50000,20000,60000]
df

       Name  Age     City  Salary
0    Aditya   22  Jodhpur   50000
1  Lavaniya   19    Delhi   20000
2     Ashii   22     Kota   60000

##### Drop-> Remove Column

In [72]:
df.drop('Salary',axis=1)
# What problem we are facing by default axis is 0, which mean it check 'Salary' in rows, so we have to make axis = 1 to check in column.

# It is not permanent operation it is temporary operation it will again find salary if we use again.

# To make delete column permanent we have to use inplace operation as True.

       Name  Age     City
0    Aditya   22  Jodhpur
1  Lavaniya   19    Delhi
2     Ashii   22     Kota

##### Inplace Operation

In [73]:
df.drop('Salary', axis=1, inplace= True)
df

       Name  Age     City
0    Aditya   22  Jodhpur
1  Lavaniya   19    Delhi
2     Ashii   22     Kota

##### Increase age by 1 for all user.

In [75]:
df['Age'] = df['Age'] +1
df

       Name  Age     City
0    Aditya   24  Jodhpur
1  Lavaniya   21    Delhi
2     Ashii   24     Kota

##### Drop based on rows

In [ ]:
df.drop(0)

       Name  Age   City
1  Lavaniya   21  Delhi
2     Ashii   24   Kota

In [79]:
# To remove permantent we have to use inplace = True.
df.drop(0, inplace= True)

In [80]:
df

       Name  Age   City
1  Lavaniya   21  Delhi
2     Ashii   24   Kota

##### dtypes-> Display data types of each columns.

In [81]:
print("Data-type:", df.dtypes)

Data-type: Name    object
Age      int64
City    object
dtype: object

##### describe()-> Describe the DataFrame

In [82]:
print("Statistical summary: ", df.describe())

Statistical summary:              Age
count   2.00000
mean   22.50000
std     2.12132
min    21.00000
25%    21.75000
50%    22.50000
75%    23.25000
max    24.00000